:PROPERTIES: 
# Front-page
#+TITLE:    Persuade
#+SUBTITLE: A mashup of software that I would like to introduce to my co-workers
#+AUTHOR:   Henrik Kjerringvåg
#+EMAIL:    henrik@kjerringvåg.no

#+STARTUP:  overview
#+LANGUAGE: en

# Tags
#+SEQ_TODO:            TODO(t) INPROGRESS(i) REVIEW(r@) | DONE(d) CANCELED(c@)
#+TAGS:                noexport(n) noslide(s) nopdf(p) nohtml(h)
#+EXPORT_EXCLUDE_TAGS: noexport

# Tangling
#+PROPERTY:            mkdirp yes
#+PROPERTY:            noweb yes
#+PROPERTY:            cache

# HTML
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

# PDF
#+LaTeX_CLASS:  article
#+LaTeX_HEADER: \usemintedstyle{colorful}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \doublespacing
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \hypersetup{
#+LATEX_HEADER:     colorlinks,%
#+LATEX_HEADER:     citecolor=black,%
#+LATEX_HEADER:     filecolor=black,%
#+LATEX_HEADER:     linkcolor=magenta,%
#+LATEX_HEADER:     urlcolor=black
#+LATEX_HEADER: }
#+OPTIONS:      tex:t tasks:nil inline:nil tags:nil

# Slides
#+OPTIONS:              reveal_title_slide:nil 
#+REVEAL_THEME:         solarized
#+REVEAL_HIGHLIGHT_CSS: https://cdnjs.cloudflare.com/ajax/libs/highlight.js/9.5.0/styles/solarized-dark.min.css
#+REVEAL_ROOT:          reveal.js
** And It's Really Quite Elegant                                     :noslide:
#+NAME: instruments
| Instrument | Price |
|------------+-------|
| Guitar     |  1200 |
| Piano      | 55000 |
| Violin     | 18700 |

So the argument against Lisps are usually that it's hard to read and way to many
parenthesis.

#+BEGIN_SRC clojure :var instruments=instruments
(reduce + (filter number? (map #(last %) instruments)))
#+END_SRC

As you can see, that's partially true; except we have macros like the threading-macros (~->~, ~->>~)
that makes it possible to write the same piece of code in a much more succinct, readable manner.

#+BEGIN_SRC clojure :var instruments=instruments
(->> instruments
     (map #(last %))
     (filter number?)
     (reduce +))
#+END_SRC

#+RESULTS: :exports t
: 74900

